# Height Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NonContinuousRailInfo..::..Height Property
NonContinuousRailInfo Class See Also
---
The height at which the non-continuous rail will be placed.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public double Height { get; set; }
```

Visual Basic
---
```text
Public Property Height As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Height {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The height height is not valid for the non-continuous rail. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for height must be no more than 30000 feet in absolute value. |

# See Also
NonContinuousRailInfo Class
Autodesk.Revit.DB.Architecture Namespace